using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace DynamisFramework
{
    namespace Command 
    {
        /// <summary>
        /// コマンド管理・実行クラス
        /// </summary>
        public class CommandManager : Utility.Singleton<CommandManager>
        {
            //=====================================================================================================================
            // 内部クラス・列挙型定義
            //=====================================================================================================================

            //=====================================================================================================================
            // 定数
            //=====================================================================================================================

            //=====================================================================================================================
            // 変数
            //=====================================================================================================================
            private Queue<ICommand> _commandQueue = null;

            //=====================================================================================================================
            // プロパティ
            //=====================================================================================================================

            //=====================================================================================================================
            // コンストラクタ
            //=====================================================================================================================
            public CommandManager()
            {
                _commandQueue = new Queue<ICommand>();
            }

            //=====================================================================================================================
            // Private関数
            //=====================================================================================================================

            //=====================================================================================================================
            // Public関数
            //=====================================================================================================================
            
            /// <summary>
            /// コマンドをキューに入れる
            /// </summary>
            /// <param name="command"></param>
            /// <returns></returns>
            public bool EnqueueCommand(ICommand command) 
            { 
                if(command == null)
                {
                    Debug.LogError($"[CommandManager] => Failed add command. Command is null.");
                    return false;
                }

                _commandQueue.Enqueue(command);
                return true;
            }

            /// <summary>
            /// キュー内にある全てのコマンドを実行
            /// </summary>
            public void ExecuteAllCommand()
            {
                if (_commandQueue.IsNullOrEmpty())
                {
                    return;
                }

                while(_commandQueue.Count > 0)
                {
                    ICommand command = _commandQueue.Dequeue();
                    command.Execute();
                }

                _commandQueue.Clear();
            }

            /// <summary>
            /// キューに入っているキャッシュをクリア
            /// </summary>
            public void ClearCommandCache()
            {
                _commandQueue.Clear();
            }

        } // class CommandManager
    }// namespace Command
}// namespace DynamisFramework
