using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace CannonShooting
{
    /// <summary>
    /// 外部へのアクセス権限を保証するインターフェース
    /// </summary>
    public interface IBullet
    {
        //=====================================================================================================================
        // プロパティ
        //=====================================================================================================================
        string ID { get; }
        eBulletType BulletType { get; }

        //=====================================================================================================================
        // 関数
        //=====================================================================================================================


    } // interface IBullet
}// namespace CannonShooting
