using System.Collections;
using System.Collections.Generic;
using UnityEngine;


/// <summary>
/// 
/// </summary>

namespace CannonShooting
{
    public interface ICannon
    {
        //=====================================================================================================================
        // プロパティ
        //=====================================================================================================================
        string ID { get; }

        //=====================================================================================================================
        // 関数
        //=====================================================================================================================

        /// <summary>
        /// 台座の回転
        /// </summary>
        void RotateLowerCarriage();

        /// <summary>
        /// 砲台の回転
        /// </summary>
        void RotateBarrel();

    } // ICannon
}// namespace CannonShooting
