using System.Collections;
using System.Collections.Generic;
using UnityEngine;


/// <summary>
/// MonoBehaviourルーチンの基礎クラス。
/// MonoBehaviourのルーチンを使用するオブジェクトはすべてこのクラスを継承して処理を記載する。
/// </summary>
public class MonoBehaviourRoutineBase<Control> : IMonoBehaviourRoutine where Control : MonoBehaviourRoutineBase<Control> 
{

    //=====================================================================================================================
    // 内部クラス・列挙型定義
    //=====================================================================================================================

    //=====================================================================================================================
    // 定数
    //=====================================================================================================================
    private Control _control;

    //=====================================================================================================================
    // 変数
    //=====================================================================================================================

    //=====================================================================================================================
    // プロパティ
    //=====================================================================================================================

    //=====================================================================================================================
    // コンストラクタ
    //=====================================================================================================================
    public MonoBehaviourRoutineBase(Control control)
    {
        _control = control;

        // MonoBehaviourRoutineManagerに登録する
        if(MonoBehaviourRoutineManager.IsInitialized == false)
        {
            Debug.LogErrorFormat($"<color=green>[MonoBehaviourRoutineBase]</color> MonoBehaviourRoutineManagerのInstanceが取得できませんでした。");
            return;
        }

        if(_control == null)
        {
            Debug.LogErrorFormat($"<color=green>[MonoBehaviourRoutineBase]</color> MonoBehaviourRoutineManagerに登録するインスタンスがありません。");
            return;
        }

        MonoBehaviourRoutineManager.Instance.AddRoutneUpdateList(_control);
    }

    //=====================================================================================================================
    // MonoBehaviour関数
    //=====================================================================================================================

　　public virtual void Awake()
    {
        _control.Awake();
    }

　　public virtual void OnEnable()
    {
        _control.OnEnable();
    }

　  public virtual void Start()
    {

    }

    public virtual void FixedUpdate()
    {

    }

    
    public virtual void Update()
    {

    }

    public virtual void LateUpdate()
    {

    }

    public virtual void OnDisable()
    {
        _control.OnDisable();
    }

    public virtual void OnDestroy()
    {

    }

    //=====================================================================================================================
    // Private関数
    //=====================================================================================================================

    //=====================================================================================================================
    // Public関数
    //=====================================================================================================================


} // NewMonoBehaviourScript
